/* eslint-disable @next/next/no-img-element */

import { nunitoMedium } from "@/public/fonts"
import { useState } from "react"

type Props = {
  name?: string
  series?: string
  date?: string
  like?: number
  dislike?: number
}

const FilmCard = ({ name, series, date, like, dislike }: Props) => {
  const [isFavourites, setIsFavourites] = useState<boolean>(false)

  const favouritesHandlerClick = () => {
    setIsFavourites(prev => !prev)
  }

  const rating = like! / (like! + dislike!) * 100

  return (
    <div className="w-[44.7rem]">
      <img className="w-full h-[26.4rem] rounded-[.4rem] mb-[1.2rem]" src="/images/test.jpg" alt="film preview image" />

      <div className="flex justify-between mb-[3rem]">
        <div className="inline-block">
          <h3 className={`${nunitoMedium} text-4xl text-white mb-[1rem]`}>{name}</h3>
          <p className="text-2xl text-gray">{series ? `${series}, ${date}` : `${date}`}</p>
        </div>
        <button className="h-min" onClick={favouritesHandlerClick}>
          <svg className="w-[2rem] h-[1.8rem]" viewBox="0 0 22 20" fill="none">
            <path d="M19.3383 10.6495L11.0093 19L2.68024 10.6495C2.13086 10.1083 1.69813 9.45782 1.40928 8.73903C1.12044 8.02024 0.981741 7.2487 1.00193 6.47298C1.02211 5.69726 1.20074 4.93418 1.52656 4.23178C1.85239 3.52938 2.31835 2.90289 2.89511 2.39174C3.47187 1.8806 4.14693 1.49588 4.87778 1.26181C5.60863 1.02775 6.37944 0.949401 7.14167 1.03171C7.9039 1.11402 8.64104 1.35521 9.30666 1.74008C9.97229 2.12494 10.552 2.64516 11.0093 3.26797C11.4685 2.64968 12.0489 2.13401 12.714 1.75323C13.3792 1.37244 14.1149 1.13474 14.875 1.055C15.635 0.975265 16.4032 1.0552 17.1314 1.28982C17.8596 1.52443 18.5321 1.90867 19.1068 2.41848C19.6815 2.92829 20.1461 3.55271 20.4715 4.25264C20.7969 4.95258 20.976 5.71297 20.9978 6.48622C21.0195 7.25947 20.8833 8.02894 20.5978 8.74647C20.3122 9.464 19.8834 10.1141 19.3383 10.6562" stroke={isFavourites ? "none" : "#585858"} fill={isFavourites ? "#A12E2E" : "none"} stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
        </button>
      </div>

      <div className="mb-[1.2rem]">
        <button className="h-min mr-[1.6rem]">
          <svg className="w-[2.1rem] h-[2rem]" viewBox="0 0 23 22" fill="none">
            <path d="M5.94118 9.74737V19.7444C5.94118 20.0758 5.81103 20.3936 5.57937 20.628C5.3477 20.8623 5.0335 20.994 4.70588 20.994H2.23529C1.90767 20.994 1.59347 20.8623 1.36181 20.628C1.13015 20.3936 1 20.0758 1 19.7444V10.997C1 10.6656 1.13015 10.3477 1.36181 10.1134C1.59347 9.87902 1.90767 9.74737 2.23529 9.74737H5.94118ZM5.94118 9.74737C7.25166 9.74737 8.50847 9.22074 9.43512 8.28334C10.3618 7.34594 10.8824 6.07456 10.8824 4.74887V3.49925C10.8824 2.83641 11.1426 2.20071 11.606 1.73201C12.0693 1.26331 12.6977 1 13.3529 1C14.0082 1 14.6366 1.26331 15.0999 1.73201C15.5632 2.20071 15.8235 2.83641 15.8235 3.49925V9.74737H19.5294C20.1847 9.74737 20.8131 10.0107 21.2764 10.4794C21.7397 10.9481 22 11.5838 22 12.2466L20.7647 18.4947C20.5871 19.2613 20.25 19.9196 19.8045 20.3704C19.3589 20.8211 18.8288 21.04 18.2941 20.994H9.64706C8.6642 20.994 7.72159 20.599 7.0266 19.896C6.33162 19.1929 5.94118 18.2394 5.94118 17.2451" fill="white" stroke="black" stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
        </button>
        <button className="h-min">
          <svg className="w-[2.1rem] h-[2rem]" viewBox="0 0 23 22" fill="none">
            <path d="M17.0588 12.2526L17.0588 2.25564C17.0588 1.92422 17.189 1.60637 17.4206 1.37202C17.6523 1.13767 17.9665 1.00602 18.2941 1.00602H20.7647C21.0923 1.00602 21.4065 1.13767 21.6382 1.37202C21.8699 1.60637 22 1.92422 22 2.25564L22 11.003C22 11.3344 21.8699 11.6523 21.6382 11.8866C21.4065 12.121 21.0923 12.2526 20.7647 12.2526H17.0588ZM17.0588 12.2526C15.7483 12.2526 14.4915 12.7793 13.5649 13.7167C12.6382 14.6541 12.1176 15.9254 12.1176 17.2511V18.5008C12.1176 19.1636 11.8574 19.7993 11.394 20.268C10.9307 20.7367 10.3023 21 9.64706 21C8.99182 21 8.36341 20.7367 7.90009 20.268C7.43676 19.7993 7.17647 19.1636 7.17647 18.5008L7.17647 12.2526H3.47059C2.81535 12.2526 2.18694 11.9893 1.72362 11.5206C1.26029 11.0519 1 10.4162 1 9.75338L2.23529 3.50527C2.41295 2.73865 2.74995 2.08039 3.19555 1.62962C3.64115 1.17886 4.1712 0.960002 4.70588 1.00602L13.3529 1.00602C14.3358 1.00602 15.2784 1.40099 15.9734 2.10404C16.6684 2.80709 17.0588 3.76063 17.0588 4.75489" stroke="white" stroke-linecap="round" stroke-linejoin="round"/>
          </svg>
        </button>
      </div>

      <p className={`${nunitoMedium} text-xl text-white`}>{Number.isNaN(rating) ? "Нет оценок" : `${rating}% положительно оценили`}</p>
    </div>
  )
}

export default FilmCard